# API Platform Cloud Service Tutorial

API Platform Cloud Service（APIPCS）のチュートリアルです。

このチュートリアルではAPIPCSの環境設定、API開発などに必要なタスクを辿っていきます。詳細は[APIの設計](./tutorials/design/design_api)をご覧ください。

> 注：リンクは常に新しいタブで開いてください（右クリック→*新しいタブでリンクを開く*）。そうすれば、タスクを完了後にリンク先のチュートリアルなどからこの演習ガイドに戻ってくることができます。

## 進め方

このトレーニングの全体構成は以下のようになっています。

- シナリオ
  - チュートリアル

シナリオを開始する際に、リンク先のチュートリアルを開いてガイダンスを参照することもできますが、盲目的にチュートリアルの手順に従うのではなく、必要なガイダンスだけで操作するようにしてください。実際には、変更を加える際にAPIをデプロイするなど、自然に繰り返されるいくつかのタスクがあります。最初のデプロイ時にはチュートリアルを使う必要があるかもしれませんｇ、2回目以後は独力で試してください。

## Getting Started

1. 必要な環境を選択します。
    1. [環境](./environments) に従って選択する
    1. [シナリオ](./scenarios) に従って利用したいシナリオを選択する（こちらは現時点で1個のみなので選択は簡単ですね）
  
> 注：リンクは常に新しいタブで開いてください（右クリック→*新しいタブでリンクを開く*）。そうすれば、タスクを完了後にリンク先のチュートリアルなどからこの演習ガイドに戻ってくることができます。
